# -*- coding: utf-8 -*-
# @Author  : zqbai
# @Time    : 2023/4/3 下午4:14
# @Function: 

stop_words = {'微博', '视频', '搜', '真的', '什么', '的', '了', '在', '是', '我', '你', '他', '她', '它', '和', '与', '去', '吧','请', '都','啊', '知道', '用'
              '或', '这', '那', '个', '些', '很', '多', '觉得', '出', '自己', '结果', '最近', '不', '一个', '能', '谁', '呢', '要','有', '没', '好', '这么', '有'
              '关于', '人', '全文', '就是', '说', '我们', '大家', '被', '所以', '就', '一些', '一定', '一点', '一直', '一样',
              '一次', '一起', '一些', '一份', '一下', '一些', '两个', '三个', '几个', '这些', '那些', '这个', '那个', '所有',
              '所有的', '任何', '任何人', '任何事', '任何时候', '任何方式', '任何情况', '别人', '另外', '其他', '其他人', '其他事', '其他时候',
              '其他方式', '其他情况', '自己的', '有些', '有时候', '有着', '只有', '只是', '只有', '就是说', '好的', '很多', '许多',
              '大部分', '绝大部分', '少数', '少部分', '一切', '每个', '每一个', '每件事', '每一时刻', '任何地方', '任何时候', '任何原因',
               '每个人', '每一件事', '每种', '每种情况', '什么样', '那样', '这样', '那样的', '这样的', '那个', '这个', '那种', '这种',
              '哪个', '哪一个', '哪种', '那一种', '这一种', '哪些', '什么的', '那些的', '这些的', '一切的', '全部的', '每个人的',
              '每件事的', '任何人的', '任何事的', '任何情况的', '有关', '当然', '之前', '之后', '之内', '之间', '之外', '可以', '可能',
              '不可能', '实现', '实际上', '现在', '同时', '但是', '然而', '虽然', '尽管', '无论如何', '无论', '而且', '此外',
              '即使', '因为', '所以', '由于', '要求', '需要', '推荐', '请求', '建议', '希望', '尽可能', '最好', '通常', '一般',
              '有时', '很少', '偶尔', '有时候', '可能会', '有些', '一些', '有点', '好像', '似乎', '好了', '不错', '不行', '不要', '不必', '不能', '不想',
              '不用', '不必要', '没有', '不是', '不然', '不如', '不会','可以', '可能', '应该', '应当', '一定', '必须', '需要', '要求', '要是', '要不', '要不然', '比如', '例如', '像是', '只是', '还是', '还有',
              '以及', '尤其','并且', '但是', '然后', '之后', '接着', '同时', '而且', '除了', '以外', '依然', '依旧', '仍然', '仍旧', '尽管', '虽然', '但', '还', '这样',
              '这时', '这里','那样', '那么', '那时', '那里', '只有', '就要', '才能', '才会', '越来越', '已经', '正在', '还有', '就像', '时候', '自然', '应该', '为了',
              '对于', '同时','一直', '经常', '常常', '大概', '不断', '不时', '不曾', '从未', '偶尔', '突然', '马上', '立即', '立刻', '随时', '时刻', '每次', '总是',
              '往往', '通常', '一般','常常', '总的来说', '总的说来', '总的来讲', '绝对', '完全', '彻底', '全部', '从不', '从未', '决不', '毫不', '一点', '有点', '稍微', '有些',
              '比较', '更加', '最为','非常', '极其', '异常', '相当', '特别', '十分', '细心', '特意', '其实', '事实上', '确实', '实际上', '当然', '无论', '不管', '不论', '任何',
              '只要', '就算', '即使','这个', '它们', '他们', '自己', '的话', '什么的', '等等', '之类', '之类的', '啥的', '什么之类', '别的', '或者', '或是'}

